# Pandas Basics <hr style="border:2.5px solid #1b92c5ff"></hr>

<b>Vince Saimon Canencia</b>
<br>CpE2A</b>

In [21]:
# %pip install matplotlib --upgrade

In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# DataFrame

In [23]:
data = {
    "Name": ["Henry", "Owen", "Ada"],
    "Age": [22, 35, 58],
    "Sex": ["M", "M", "F"]
}

In [24]:
df = pd.DataFrame(data)
df

    Name  Age Sex
0  Henry   22   M
1   Owen   35   M
2    Ada   58   F

# Series

In [25]:
df["Name"]

0    Henry
1     Owen
2      Ada
Name: Name, dtype: object

In [26]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [27]:
df["Sex"]

0    M
1    M
2    F
Name: Sex, dtype: object

# Descriptive Statistics

In [28]:
resistance = np.array([
    [10.6, 9.1, 9.3, 9.8, 10.5, 10.4, 9.5, 11.0, 4.3, 9.8],
    [10.1, 11.9, 1.2, 9.2, 10.8, 8.9, 9.2, 9.1, 9.1, np.nan]
])

resistance

array([[10.6,  9.1,  9.3,  9.8, 10.5, 10.4,  9.5, 11. ,  4.3,  9.8],
       [10.1, 11.9,  1.2,  9.2, 10.8,  8.9,  9.2,  9.1,  9.1,  nan]])

In [29]:
df = pd.DataFrame(resistance.T, columns=["Jaguar", "Panther"])
df

   Jaguar  Panther
0    10.6     10.1
1     9.1     11.9
2     9.3      1.2
3     9.8      9.2
4    10.5     10.8
5    10.4      8.9
6     9.5      9.2
7    11.0      9.1
8     4.3      9.1
9     9.8      NaN

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Jaguar   10 non-null     float64
 1   Panther  9 non-null      float64
dtypes: float64(2)
memory usage: 292.0 bytes

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.describe()

         Jaguar    Panther
count  10.00000   9.000000
mean    9.43000   8.833333
std     1.90441   3.032326
min     4.30000   1.200000
25%     9.35000   9.100000
50%     9.80000   9.200000
75%    10.47500  10.100000
max    11.00000  11.900000